Q. 1) Convert the Datatype of 'Date' column to Date-Time format.

Q. 2) Add a new column ''year'' in the dataframe, which contains years only.(B.2) Add a new column ''month'' as 2nd column in 
the dataframe, which contains month only.

Q. 3) Remove the columns 'year' and 'month' from the dataframe.

Q. 4) Show all the records where 'No. of Crimes' is 0. And, how many such records are there ?

Q. 5) What is the maximum & minimum 'average_price' per year in england ?

Q. 6) What is the Maximum & Minimum No. of Crimes recorded per area ?

Q. 7) Show the total count of records of each area, where average price is less than 100000.

In [67]:
import pandas as pd

In [68]:
df = pd.read_csv('5. London Housing Data.csv')

In [69]:
data = df.copy()

In [70]:
data.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN

In [71]:
data.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

In [72]:
data['houses_sold'].fillna(data['houses_sold'].mean(), inplace = True)
data.count()

date             13549
area             13549
average_price    13549
code             13549
houses_sold      13549
no_of_crimes      7439
dtype: int64

In [73]:

data.dtypes
data.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN

In [74]:
##question 1
data['date'] = pd.to_datetime(data['date'])

In [75]:
data.dtypes

date             datetime64[ns]
area                     object
average_price             int64
code                     object
houses_sold             float64
no_of_crimes            float64
dtype: object

In [78]:
##Question 2
data['Year'] = pd.DatetimeIndex(data['date']).year

In [79]:
data.head()

,date,area,average_price,code,houses_sold,no_of_crimes,Year
0,1995-01-01,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,city of london,79121,E09000001,14.0,NaN,1995
3,1995-04-01,city of london,77101,E09000001,7.0,NaN,1995
4,1995-05-01,city of london,84409,E09000001,10.0,NaN,1995

In [80]:
data.insert(1 , 'Month', pd.DatetimeIndex(data['date']).month)

In [83]:
data.head()

,date,Month,area,average_price,code,houses_sold,no_of_crimes,Year
0,1995-01-01,1,city of london,91449,E09000001,17.0,NaN,1995
1,1995-02-01,2,city of london,82203,E09000001,7.0,NaN,1995
2,1995-03-01,3,city of london,79121,E09000001,14.0,NaN,1995
3,1995-04-01,4,city of london,77101,E09000001,7.0,NaN,1995
4,1995-05-01,5,city of london,84409,E09000001,10.0,NaN,1995

In [85]:
##question 3 made a seperate variable so the actual data is not affected

data_no_column = data.drop(['Month','Year'], axis = 1)

In [86]:
data_no_column.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN
1,1995-02-01,city of london,82203,E09000001,7.0,NaN
2,1995-03-01,city of london,79121,E09000001,14.0,NaN
3,1995-04-01,city of london,77101,E09000001,7.0,NaN
4,1995-05-01,city of london,84409,E09000001,10.0,NaN

In [90]:
##question 4
data[data['no_of_crimes']== 0].count()

date             104
Month            104
area             104
average_price    104
code             104
houses_sold      104
no_of_crimes     104
Year             104
dtype: int64

In [99]:
##question 5
data.groupby('Year')['average_price'].max().head(10)

Year
1995    200722
1996    223197
1997    265112
1998    277600
1999    354241
2000    397353
2001    451028
2002    497538
2003    488704
2004    559286
Name: average_price, dtype: int64

In [98]:
data.groupby('Year')['average_price'].min().head(20)

Year
1995     41688
1996     40722
1997     42353
1998     43510
1999     43969
2000     47604
2001     49045
2002     54746
2003     67520
2004     88520
2005    110454
2006    121124
2007    131175
2008    120275
2009    117079
2010    119688
2011    115328
2012    113011
2013    112008
2014    114531
Name: average_price, dtype: int64

In [97]:
##question 6
data.groupby('area')['no_of_crimes'].max().head(20)

area
barking and dagenham      2049.0
barnet                    2893.0
bexley                    1914.0
brent                     2937.0
bromley                   2637.0
camden                    4558.0
city of london              10.0
croydon                   3263.0
ealing                    3401.0
east midlands                NaN
east of england              NaN
enfield                   2798.0
england                      NaN
greenwich                 2853.0
hackney                   3466.0
hammersmith and fulham    2645.0
haringey                  3199.0
harrow                    1763.0
havering                  1956.0
hillingdon                2819.0
Name: no_of_crimes, dtype: float64

In [101]:
data.groupby('area')['no_of_crimes'].min().head(10)

area
barking and dagenham    1217.0
barnet                  1703.0
bexley                   860.0
brent                   1850.0
bromley                 1441.0
camden                  2079.0
city of london             0.0
croydon                 2031.0
ealing                  1871.0
east midlands              NaN
Name: no_of_crimes, dtype: float64

In [109]:
data[data['average_price'] < 100000]['area'].value_counts().head(20)

north east              112
north west              111
yorks and the humber    110
east midlands            96
west midlands            94
england                  87
barking and dagenham     85
south west               78
east of england          76
newham                   72
bexley                   64
waltham forest           64
lewisham                 62
havering                 60
south east               59
greenwich                59
croydon                  57
enfield                  54
sutton                   54
hackney                  53
Name: area, dtype: int64